# 제품 ID별 키워드 매핑
product_keywords = {
    # 스타터 키트
    "6086408637": [
        "유튜브 촬영장비",
        "개인방송 장비",
        "방송장비",
        "촬영장비"
    ],
    # 스마트그립 키트
    "9379942929": [
        "유튜브 촬영장비",
        "촬영장비",
        "방송장비",
        "개인방송장비",
        "유튜브방송장비",
        "유튜브촬영카메라",
        "유튜브 장비",
        "유튜브 촬영"
    ],
#     # 셀카봉
#     "10697830964": [
#         "아이폰 셀카봉",
#         "휴대폰 셀카봉",
#         "아이폰 삼각대",
#         "핸드폰 셀카봉",
#         "셀카봉 삼각대",
#         "블루투스 셀카봉",
#         "스마트폰셀카봉",
#         "셀카봉",
#         "셀카",
#         "갤럭시 셀카봉",
#         "무선 셀카봉",
#         "휴대폰 삼각대",
#         "핸드폰촬영 거치대",
#         "브이로그 삼각대",
#         "여행용 삼각대",
#         "삼각대",
#         "스마트폰 거치대",
#         "핸드폰 삼각대",
#         "삼각대 셀카봉",
#         "미니 삼각대",
#         "촬영용 거치대",
#         "유튜브촬영장비",
#         "휴대폰촬영거치대",
#         "셀피스틱",
#         "셀카스틱",
#         "스마트폰삼각대",
#         "TRIPOD"
#     ],
#     # TM마이크
#     "10505636828": [
#         "C타입 마이크",
#         "콘덴서 마이크",
#         "핸드폰 마이크",
#         "아이폰 마이크",
#         "ASMR 마이크",
#         "브이로그 마이크",
#         "촬영 마이크"
#     ],
#     # 핀마이크
#     "5374385772": [
#         "핀마이크",
#     ]
} 